Repository: alexrusu-rsa/archimedes
Catalog: src/locale/messages.*.xlf
Languages: ro

# menu-home-button
source: Home
ro: Acasă

# menu-users-button
source: Users
ro: Utilizatori

# menu-projects-button
source: Projects
ro: Proiecte

# menu-customers-button
source: Customers
ro: Clienți

# menu-reporting-button
source: Reporting
ro: Raportare

# menu-invoices-button
source: Invoices
ro: Facturi

# menu-logout-button
source: Log Out
ro: Deconectare

# login-page-title
source: Login
ro: Autentificare

# login-page-email-required
source: Email is required
ro: Adresa de email este obligatorie

# login-page-password
source: Password
ro: Parolă

# login-page-password-required
source: Password is required
ro: Parola este obligatorie

# login-page-forgot-password
source: Forgotten Password
ro: Parolă uitată

# login-page-button
source: Log in
ro: Autentificare

# password-reset-page-title
source: Reset your password
ro: Resetează parola contului

# password-reset-email-required
source: Email is required
ro: Adresa de email este obligatorie

# password-reset-button
source: Reset Password
ro: Resetează Parola

# activity-dialog-add-title
source: Add Activity
ro: Adaugă Activitate

# activity-dialog-activityName
source: Activity Name
ro: Numele Activității

# activity-dialog-activityName-required
source: Activity name is required
ro: Numele activității este obligatoriu

# activity-dialog-activityEnd
source: End
ro: Sfârșit

# activity-dialog-activityProject
source: Project
ro: Proiect

# activity-dialog-activityType
source: Activity type
ro: Tipul Activității

# activity-dialog-activityDescription
source: Activity Description
ro: Descrierea Activității

# activity-dialog-activityExtras
source: Activity Extras
ro: Extras

# activity-dialog-add-button
source: Add activity
ro: Adaugă Activitatea

# activity-dialog-update-title
source: Update Activity
ro: Actualizează Activitatea

# activity-dialog-update-button
source: Update Activity
ro: Actualizează Activitatea

# activity-page-title
source: Activities of selected day
ro: Activitățile zilei selectate

# customer-dialog-add-title
source: Add Customer
ro: Adaugă Client

# customer-dialog-customerName
source: Customer Name
ro: Nume Client

# customer-dialog-customerCUI
source: Customer CUI
ro: CUI Client

# customer-dialog-customerReg
source: Customer Reg
ro: Reg. Clientului

# customer-dialog-customerAddress
source: Customer Address
ro: Adresă Client

# customer-dialog-customerCity
source: Customer City
ro: Oraș Client

# customer-dialog-customerCountry
source: Customer Country
ro: Țară Client

# customer-dialog-customerDirectorName
source: Customer Director Name
ro: Numele Directorului Firmei Client

# customer-dialog-customerDirectorEmail
source: Customer Director Email
ro: Adresă Email Director Client

# customer-dialog-customerDirectorTel
source: Customer Director Tel
ro: Telefon Director Client

# customer-dialog-add-button
source: Add customer
ro: Adaugă client

# customer-dialog-update-title
source: Update Customer
ro: Actualizează Client

# customer-dialog-update-button
source: Update customer
ro: Actualizează client

# customer-page-title
source: Customer page
ro: Pagină Clienți

# customer-page-search-hint
source: Search customer
ro: Caută client

# invoice-dialog-title
source: Invoice Number:
ro: Numărul Facturii:

# invoice-dialog-pdf-button
source: Download PDF
ro: Descarcă PDF

# invoice-dialog-xlsx-button
source: Download XLSX
ro: Descarcă XLSX

# invoice-page-title
source: Invoices
ro: Facturi

# invoice-page-month-year-hint
source: Month and Year
ro: Lună și An

# invoice-page-project-date
source: Month: {{ selectedMonth }} - {{ selectedYear }}
ro: Lună: {{ selectedMonth }} - {{ selectedYear }}

# project-dialog-add-title
source: Add Project
ro: Adaugă Proiect

# project-dialog-projectName
source: Project Name
ro: Nume Proiect

# project-dialog-projectCustomerName
source: Customer name
ro: Nume Client

# project-dialog-projectContract
source: Project Contract
ro: Contract Proiect

# project-dialog-projectDueDate
source: Due date
ro: Dată scadentă

# project-dialog-add-button
source: Add project
ro: Adaugă proiect

# project-dialog-update-title
source: Update Project
ro: Actualizează Proiect

# project-dialog-update-button
source: Update project
ro: Actualizează proiect

# project-page-title
source: Project page
ro: Pagină Proiecte

# project-page-search-hint
source: Search project
ro: Caută proiect

# reporting-page-title
source: Reporting Page
ro: Pagină Raportare

# reporting-page-selectDateRange
source: Select date range
ro: Selectează interval date

# reporting-page-employeeName
source: Employee name
ro: Numele angajatului

# reporting-page-users
source: All users
ro: Toți angajații

# reporting-page-card-activityDescription
source: DESCRIPTION
ro: DESCRIERE

source: Name: {{ currentUser.name }} {{ currentUser.surname }}
ro: Nume: {{ currentUser.name }} {{ currentUser.surname }}

source: Role: {{ currentUser.role }}
ro: Rol: {{ currentUser.role }}

source: Seniority: {{ currentUser.seniority }}
ro: Senioritate: {{ currentUser.seniority }}

source: Date: {{ activity.date }}
ro: Dată: {{ activity.date }}

source: Time: {{ activity.start }} - {{ activity.end }}
ro: Timp: {{ activity.start }} - {{ activity.end }}

# user-dialog-add-title
source: Add User
ro: Adaugă Utilizator

# user-dialog-userSurname
source: User Surname
ro: Numele de familie

# user-dialog-userSurname-required
source: User surname is required
ro: Numele de familie este obligatoriu

# user-dialog-userName
source: User Name
ro: Prenume

# user-dialog-userName-required
source: User name is required
ro: Prenumele este obligatoriu

# user-dialog-userEmail
source: User Email
ro: Adresă de email

# user-dialog-userEmail-required
source: User email is required
ro: Adresa de email este obligatorie

# user-dialog-userRole
source: User Role
ro: Rol

# user-dialog-userRole-required
source: User role is required
ro: Rolul este obligatoriu

# user-dialog-userSeniority
source: User Seniority
ro: Senioritate

# user-dialog-userSeniority-required
source: User role is required
ro: Campul senioritate este obligatoriu

# user-dialog-userTimePerDay
source: User time/day
ro: Timp/zi

# user-dialog-userTimePerDay-required
source: User Time/Day is required
ro: Timp/zi este obligatoriu

# user-dialog-add-button
source: Add user
ro: Adaugă utilizator

# user-dialog-update-title
source: Update user
ro: Actualizează utilizator

# user-dialog-update-button
source: Update user
ro: Actualizează utilizator

# user-page-title
source: User page
ro: Pagină Utilizatori

# user-page-search-hint
source: Search user
ro: Caută utilizator

# user-page-resetPassword-button
source: Reset Password
ro: Reseteaza parola
